In [1]:
import numpy as np 
import pandas as pd

In [2]:
labels = ['John','Tom','jenny','Mike']
data = [19,22,25,26]
arr = np.array(data)
age_dict = {'Rafael' : 11 , 'Rachel' : 13  , 'Thomas' : 5 , 'Nick' : 22 }

In [3]:
pd.Series(age_dict) #series are different from arrays because they can have labels

Rafael    11
Rachel    13
Thomas     5
Nick      22
dtype: int64

In [4]:
pd.Series (data,labels) #first argument our data , 2nd the labels.

John     19
Tom      22
jenny    25
Mike     26
dtype: int64

In [5]:
newdata = [13,23,11]

In [6]:
#pd.Series(newdata,labels) ........... we cannot
#execute this since labels and data_ don't have the same length

In [7]:
labels = ('John','Tom','jenny','Mike') #it can also take tuples as arguments
data = (19,22,25,26)
pd.Series (data,labels)

John     19
Tom      22
jenny    25
Mike     26
dtype: int64

In [8]:
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(3,3),['john','mike','Tris'],['day','month','year'])
df

           day     month      year
john  2.706850  0.628133  0.907969
mike  0.503826  0.651118 -0.319318
Tris -0.848077  0.605965 -2.018168

In [9]:
#let's create a dataframe with random numbers based on people's age.
from numpy.random import randint
day = np.array([randint(1,30) for i in range(0,3)])
month = np.array([randint(1,13) for i in range(0,3)])
year = np.array([randint(1900,2023) for i in range(0,3)])
age = np.array([day,month,year]).reshape(3,3).transpose()
df = pd.DataFrame(age,['john','mike','Tris'],['day','month','year'] )
df

      day  month  year
john   18     11  1929
mike   20      9  2015
Tris   16      4  1959

In [10]:
#let's calculate their aproximate age and add a new column
import datetime
year = datetime.date.today().year
df['age'] = year-df['year']
df

      day  month  year  age
john   18     11  1929   93
mike   20      9  2015    7
Tris   16      4  1959   63

In [11]:
# and now let's drop the year column 
df.drop('year',inplace = True , axis = 1)
df

      day  month  age
john   18     11   93
mike   20      9    7
Tris   16      4   63

In [12]:
df['month'] #for accessing a column

john    11
mike     9
Tris     4
Name: month, dtype: int32

In [13]:
df.loc['mike'] #for accessing a row

day      20
month     9
age       7
Name: mike, dtype: int32

In [14]:
df.iloc[2] #for accessing a row by number

day      16
month     4
age      63
Name: Tris, dtype: int32

In [15]:
df.iloc[1,2]

7

In [16]:
df.iloc[:,1] #for accessing a column by number

john    11
mike     9
Tris     4
Name: month, dtype: int32

In [17]:
#let's say i need only the people who are 18+ years old
#df['age']>=18] gives a boolean dataframe
for g,i in enumerate(list(df[df['age']>=18].index)) : print(g,i)

0 john
1 Tris

In [18]:
#let's say we need only the day column from people 18+
df[df['age']>=18]['day']

john    18
Tris    16
Name: day, dtype: int32

In [19]:
df

      day  month  age
john   18     11   93
mike   20      9    7
Tris   16      4   63

In [20]:
#what day does john have ? 
df[df['age']>=18]['day']['john']

18

In [21]:
df.loc['zen'] = [15, 3 , 4] #let's add one more row 
df

      day  month  age
john   18     11   93
mike   20      9    7
Tris   16      4   63
zen    15      3    4

In [22]:
#df[df['age']>=18]['john']['day']  this won't run. column first.

In [23]:
#let's say we want only those born at day 17 or more and have age below 10
list(df[(df['day']>=17) & (df['age']<10)].index)

['mike']

In [24]:
#what if we want to make the index a column ?
df.reset_index()

  index  day  month  age
0  john   18     11   93
1  mike   20      9    7
2  Tris   16      4   63
3   zen   15      3    4

In [25]:
df #we see that the change wasn't inplace.

      day  month  age
john   18     11   93
mike   20      9    7
Tris   16      4   63
zen    15      3    4

In [26]:
df.reset_index(inplace = True)
df

  index  day  month  age
0  john   18     11   93
1  mike   20      9    7
2  Tris   16      4   63
3   zen   15      3    4

In [27]:
#let's create a new column and set it as the index
newlist = 'male male female male'.split()
df['gender'] = newlist
df.set_index('gender',inplace = True)
df

       index  day  month  age
gender
male    john   18     11   93
male    mike   20      9    7
female  Tris   16      4   63
male     zen   15      3    4

In [28]:
df.loc['male']

       index  day  month  age
gender
male    john   18     11   93
male    mike   20      9    7
male     zen   15      3    4

In [29]:
df.loc[ :, ~df.columns.isin(['age','month'])] #select all columns besides this list

       index  day
gender
male    john   18
male    mike   20
female  Tris   16
male     zen   15

In [30]:
df.loc[ ~df.index.isin(['male'])] #select all rows besides this list

       index  day  month  age
gender
female  Tris   16      4   63

In [31]:

#create a multilevelindex dataframe 


outerlayer = ['male','male','male','female']
innerlayer = ['john', 'peter' , 'tom', 'jenny']
ziiip = list(zip(outerlayer,innerlayer))
ziiip = pd.MultiIndex.from_tuples(ziiip)
ziiip

MultiIndex([(  'male',  'john'),
            (  'male', 'peter'),
            (  'male',   'tom'),
            ('female', 'jenny')],
           )

In [32]:
df = pd.DataFrame(randn(4,3),ziiip,['first','second','third'])
df

                 first    second     third
male   john   0.740122  0.560075  0.140054
       peter  1.395623 -0.320914  1.279975
       tom   -0.170430  0.308047 -1.061808
female jenny -1.331713  2.084437  1.753258

In [33]:
df.loc['male'].loc['peter'] #access to our multiindexlevel dataframe

first     1.395623
second   -0.320914
third     1.279975
Name: peter, dtype: float64

In [34]:
df['first']

male    john     0.740122
        peter    1.395623
        tom     -0.170430
female  jenny   -1.331713
Name: first, dtype: float64

In [35]:
df.index.names = ['out', 'in'] #name our idices
df

                 first    second     third
out    in
male   john   0.740122  0.560075  0.140054
       peter  1.395623 -0.320914  1.279975
       tom   -0.170430  0.308047 -1.061808
female jenny -1.331713  2.084437  1.753258

In [36]:
df.xs('tom',level = 'in')

        first    second     third
out
male -0.17043  0.308047 -1.061808

In [37]:
df.xs('female', level = 'out')

          first    second     third
in
jenny -1.331713  2.084437  1.753258

In [38]:
#let's see how we deal with missing values
data = {'first' : [1,np.nan,3], 'second' : [1,2,np.nan] , 'third' : [1,2,3]}
df = pd.DataFrame(data)
df

   first  second  third
0    1.0     1.0      1
1    NaN     2.0      2
2    3.0     NaN      3

In [39]:
df.dropna() #not inplace . axis = 0 by default

   first  second  third
0    1.0     1.0      1

In [40]:
df.dropna(axis = 1)

   third
0      1
1      2
2      3

In [41]:
df.dropna(thresh = 2) #set threshold . has at least 2 non na values

   first  second  third
0    1.0     1.0      1
1    NaN     2.0      2
2    3.0     NaN      3

In [42]:
df['first'].fillna(value = df['first'].mean(), inplace = True) #fillna method
df['second'].fillna(value = df['second'].mean(), inplace = True) #fill missing values

In [43]:
df

   first  second  third
0    1.0     1.0      1
1    2.0     2.0      2
2    3.0     1.5      3

In [44]:
#let's test the groupby method  . lets create a random dataframe 
df = pd.DataFrame([['lala','person' , 3],['lala','sip',4],['rara','sip',6]],['first', 'second', 'third'],['first1', 'second2', 'third3'])
df

       first1 second2  third3
first    lala  person       3
second   lala     sip       4
third    rara     sip       6

In [45]:
byfirst1 = df.groupby('first1')

In [46]:
byfirst1.mean()

        third3
first1
lala       3.5
rara       6.0

In [47]:
byfirst1.sum()

        third3
first1
lala         7
rara         6

In [48]:
bysecond2 = df.groupby('second2')

In [49]:
bysecond2.mean()

         third3
second2
person      3.0
sip         5.0

In [50]:
bysecond2.describe()

        third3
         count mean       std  min  25%  50%  75%  max
second2
person     1.0  3.0       NaN  3.0  3.0  3.0  3.0  3.0
sip        2.0  5.0  1.414214  4.0  4.5  5.0  5.5  6.0

In [51]:
#let's see concatenation , merging 
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],['A','B','C'],['one','two','three'])

In [52]:
df1

   one  two  three
A    1    2      3
B    4    5      6
C    7    8      9

In [53]:
df2 =pd.DataFrame([[10,11,3],[13,14,6],[16,17,9]],['A','B','C'],['one','two','three'])

In [54]:
df2

   one  two  three
A   10   11      3
B   13   14      6
C   16   17      9

In [55]:
pd.concat([df1,df2])

   one  two  three
A    1    2      3
B    4    5      6
C    7    8      9
A   10   11      3
B   13   14      6
C   16   17      9

In [56]:
pd.concat([df1,df2],axis = 1)

   one  two  three  one  two  three
A    1    2      3   10   11      3
B    4    5      6   13   14      6
C    7    8      9   16   17      9

In [57]:
pd.merge(df1,df2,how = 'inner' , on = 'three')

   one_x  two_x  three  one_y  two_y
0      1      2      3     10     11
1      4      5      6     13     14
2      7      8      9     16     17

In [58]:
df3 =pd.DataFrame([[10,11,12],[13,14,15],[16,17,18],[19,20,21]],['A','B','C','D'],['one','two','three'])

In [59]:
df3

   one  two  three
A   10   11     12
B   13   14     15
C   16   17     18
D   19   20     21

In [60]:
pd.merge(df1,df3,how = 'outer' , on = 'three')  #no matchings

   one_x  two_x  three  one_y  two_y
0    1.0    2.0      3    NaN    NaN
1    4.0    5.0      6    NaN    NaN
2    7.0    8.0      9    NaN    NaN
3    NaN    NaN     12   10.0   11.0
4    NaN    NaN     15   13.0   14.0
5    NaN    NaN     18   16.0   17.0
6    NaN    NaN     21   19.0   20.0

In [61]:
pd.merge(df1,df3,how = 'left' , on = 'three') #no matchings

   one_x  two_x  three  one_y  two_y
0      1      2      3    NaN    NaN
1      4      5      6    NaN    NaN
2      7      8      9    NaN    NaN

In [62]:
#let's change df3 by one element 
df3 =pd.DataFrame([[10,11,12],[13,14,6],[16,17,18],[19,20,21]],['A','B','C','D'],['one','two','three'])

In [63]:
pd.merge(df1,df3,how = 'inner' , on = 'three')

   one_x  two_x  three  one_y  two_y
0      4      5      6     13     14

In [64]:
#let's change df3 by three elements  for 3 matchings
df3 =pd.DataFrame([[10,11,3],[13,14,6],[16,17,18],[19,20,9]],['A','B','C','D'],['one','two','three'])

In [65]:
df = pd.merge(df1,df3,how = 'inner' , on = 'three')
df

   one_x  two_x  three  one_y  two_y
0      1      2      3     10     11
1      4      5      6     13     14
2      7      8      9     19     20

In [66]:
df.columns = ['1','2','3','4', '5']
df

   1  2  3   4   5
0  1  2  3  10  11
1  4  5  6  13  14
2  7  8  9  19  20

In [67]:
df.index = ['one','two','three']
df

       1  2  3   4   5
one    1  2  3  10  11
two    4  5  6  13  14
three  7  8  9  19  20

In [68]:
#df.unique and nunique for returning the unique values (set)

In [69]:
#let's make the 3rd column times 3
df['3'] = df['3'].apply(lambda x : x * 3)
df

       1  2   3   4   5
one    1  2   9  10  11
two    4  5  18  13  14
three  7  8  27  19  20

In [70]:
#let's change one value and then try to sort it.
df['1']['one'] = 5

In [71]:
df

       1  2   3   4   5
one    5  2   9  10  11
two    4  5  18  13  14
three  7  8  27  19  20

In [72]:
df.sort_values('1')

       1  2   3   4   5
two    4  5  18  13  14
one    5  2   9  10  11
three  7  8  27  19  20

In [73]:
#an example with pivot table
del df
df = pd.DataFrame()
df['ttt'] = pd.Series(['two','one','one','two'])
df['yyy'] = pd.Series(['three','three','four','four'])
df['uuu'] = pd.Series(['si','si','ro','si'])
df['iii'] = pd.Series(['1000','4','2','2'])
df

   ttt    yyy uuu   iii
0  two  three  si  1000
1  one  three  si     4
2  one   four  ro     2
3  two   four  si     2

In [74]:
pivott = df.pivot_table(values= 'iii', index = ['yyy','uuu'], columns = 'ttt')
pivott

ttt        one     two
yyy   uuu
four  ro   2.0     NaN
      si   NaN     2.0
three si   4.0  1000.0

In [75]:
pivott.loc['three'].loc['si']['one']

4.0

In [ ]:
#INPUT - OUTPUT

#pd.read_csv('name_of_csv') ..................for input
#pd.to_csv('My output', index = False ) ......for output
#pd.to_excel('excel_output.xlsx' , sheetname = 'outputxl')
#pd.read_excel('name_excel_file', sheetname = 'input')
#pd.read_html('place url here') *makes a list of dataframes*